[
  {
    "title": "AlzGuard - Alzheimer's Detection",
    "description": "Engineered the frontend and AI model for an Alzheimer's detection tool for physicians, which won a $1000 at YIC",
    "src": "/projects/alzguard.png",
    "features": [
      "AI-powered Alzheimer's detection using machine learning",
      "Medical image analysis and processing",
      "Random-forest classifier for accurate predictions",
      "Physician-friendly interface for clinical use",
      "Real-time diagnostic results and recommendations"
    ],
    "time": "Approx. 2 months",
    "tags": ["React", "Python", "Tensorflow", "JavaScript", "CSS"],
    "highlights": [
      "Developed machine learning model for Alzheimer's detection",
      "Built intuitive frontend interface for medical professionals",
      "Won $1000 prize at Youth Innovation Challenge",
      "Achieved high accuracy in diagnostic predictions"
    ],
    "challenges": [
      "Ensuring data security and privacy",
      "Handling complex state management in the frontend",
      "Optimizing performance for a large product catalog"
    ],
    "link": "https://github.com/akramj13/AlzGuard"
  },
  {
    "title": "Voice Synthesis AI - AI-Powered Voice Generation",
    "description": "Built a modern full-stack web app that leverages AI to generate high-quality voice overs for short-form videos featuring custom topic generation and more.",
    "src": "/projects/ai-voice.png",
    "features": [
      "AI-powered voice synthesis using ElevenLabs API",
      "Custom topic generation with Gemini AI",
      "High-quality voice over generation for videos",
      "Audio transcription and processing with Assembly AI",
      "Cloud storage integration with AWS S3",
      "User authentication and session management"
    ],
    "time": "Approx. 2.5 months",
    "tags": [
      "Next.js",
      "Gemini API",
      "Assembly AI",
      "Elevenlabs",
      "AWS S3",
      "PostgreSQL (Neon)",
      "Drizzle ORM",
      "Clerk Auth"
    ],
    "highlights": [
      "Integrated ElevenLabs for realistic voice synthesis",
      "Built scalable backend with PostgreSQL and Drizzle ORM",
      "Implemented secure file storage with AWS S3",
      "Created seamless user experience with Clerk authentication",
      "Optimized audio processing pipeline for performance",
      "Deployed full-stack application with modern tech stack"
    ],
    "challenges": [
      "Managing large audio file uploads and processing",
      "Optimizing voice synthesis API response times",
      "Handling concurrent user requests efficiently",
      "Implementing secure file storage and access controls",
      "Balancing audio quality with processing speed"
    ],
    "link": "https://github.com/akramj13/ai-voice"
  },
  {
    "title": "RoboAdvisor - Stock Market Prediction",
    "description": "An AI-driven robo-advisor for stock market predictions, providing users with insights and recommendations based on real-time data analysis. Used modern portfolio theory and stochastic optimization to beat the market (S&P 500).",
    "src": "/projects/stockadvisor.png",
    "features": [
      "Real-time stock market data analysis",
      "AI-driven predictions and recommendations",
      "User-friendly dashboard with visualizations",
      "Portfolio tracking and management"
    ],
    "time": "Approx. 1.5 months",
    "tags": ["Python", "NumPy", "pandas", "yfinance", "matplotlib"],
    "highlights": [
      "Integrated multiple stock market APIs for comprehensive data",
      "Created responsive charts with Matplotlib",
      "Used modern portfolio theory for investment strategies",
      "Achieved higher returns than S&P 500 benchmark",
      "Optimized strategy using options data and market sentiment"
    ],
    "challenges": [
      "Handling large volumes of real-time data",
      "Ensuring accuracy of AI predictions",
      "Designing intuitive user interfaces for complex data"
    ],
    "link": "https://github.com/akramj13/Stock-Robo-Advisor"
  },
  {
    "title": "LearnETF - GeeseHacks 2025 Winner",
    "description": "Built a full-stack LMS platform for learning about ETFs, which won the Sun Life Sponsor prize at GeeseHacks 2025. Features interactive lessons, quizzes, and progress tracking.",
    "src": "/projects/learnetf.png",
    "features": [
      "Interactive learning modules for ETFs, stocks, and bonds",
      "Real-time market insights using Yahoo Finance API",
      "AI-powered personalized financial guidance",
      "Interactive data visualizations with Plotly",
      "Gamified modules to enhance user engagement",
      "Beginner-friendly approach for Gen-Z financial literacy"
    ],
    "time": "Approx. 2 days",
    "tags": [
      "React",
      "TypeScript",
      "Tailwind CSS",
      "Figma",
      "Next.js",
      "Python",
      "Flask",
      "OpenAI",
      "Plotly",
      "NumPy",
      "yfinance"
    ],
    "highlights": [
      "Won Sun Life Sponsor Prize at GeeseHacks 2025",
      "Built comprehensive financial literacy platform in 2 days",
      "Integrated real-time market data with yfinance and NumPy",
      "Implemented AI-powered personalized learning with OpenAI API",
      "Created interactive data visualizations with Plotly",
      "Designed accessible platform specifically for Gen-Z users"
    ],
    "challenges": [
      "Building a complete LMS platform within hackathon timeframe",
      "Integrating multiple APIs for real-time financial data",
      "Simplifying complex financial concepts for younger audiences",
      "Creating engaging gamified learning experiences",
      "Ensuring data accuracy and real-time performance"
    ],
    "link": "https://github.com/akramj13/learnetf"
  },
  {
    "title": "Full-Stack Portfolio Website",
    "description": "A sophisticated, modern portfolio website built with Next.js 15 and advanced architectural patterns. Features real-time LinkedIn data integration, custom animation systems, PostgreSQL database, admin dashboard, and microservice API architecture for scalable content management.",
    "src": "/projects/portfolio.png",
    "features": [
      "Real-time LinkedIn work experience integration via custom API",
      "Advanced animation system with Motion (Framer Motion successor) and custom blur-fade components",
      "PostgreSQL database with Prisma ORM for data persistence and caching",
      "Admin dashboard for content management and cache refresh functionality",
      "Microservice architecture with Python FastAPI backend for LinkedIn scraping",
      "Theme-aware magic card components with gradient animations",
      "Advanced search and filtering system for projects",
      "SEO optimization with Next.js 15 App Router and metadata API",
      "Responsive design with Tailwind CSS 4 and Radix UI primitives"
    ],
    "time": "Approx. 2 months",
    "tags": [
      "Next.js 15",
      "TypeScript",
      "PostgreSQL",
      "Prisma",
      "Python",
      "FastAPI",
      "Playwright",
      "Motion",
      "Tailwind CSS 4",
      "Radix UI",
      "Docker",
      "Vercel"
    ],
    "highlights": [
      "Architected full-stack application with Next.js 15 App Router and React 19",
      "Built custom LinkedIn scraping microservice using Python, FastAPI, and Playwright",
      "Implemented PostgreSQL database with Prisma ORM for efficient data management",
      "Created sophisticated animation system using Motion library with custom components",
      "Developed admin dashboard with cache management and real-time data refresh",
      "Integrated Radix UI primitives for accessible, production-ready components",
      "Optimized performance with Turbopack bundling and advanced image optimization",
      "Deployed scalable architecture with containerized microservices"
    ],
    "challenges": [
      "Designing scalable microservice architecture for LinkedIn data scraping",
      "Implementing secure authentication and rate limiting for API endpoints",
      "Creating performant custom animation components while maintaining accessibility",
      "Managing complex state synchronization between frontend cache and database",
      "Optimizing PostgreSQL queries and implementing efficient caching strategies",
      "Handling LinkedIn's anti-bot measures with sophisticated scraping techniques",
      "Balancing visual appeal with Core Web Vitals performance metrics"
    ],
    "link": "https://github.com/akramj13/portfolio"
  }
]
